src/toir_cfe/src/DataProcessors/торо_РабочееМестоСпециалистаОбеспечения/торо_РабочееМестоСпециалистаОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4b8166aa-cc94-48b5-b133-e5b863512d7a">
  <name>торо_РабочееМестоСпециалистаОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:DataProcessor>

src/toir_cfe/src/InformationRegisters/торо_АналогиНоменклатурыДляРемонтов/торо_АналогиНоменклатурыДляРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bd75473a-e6a0-45ee-a83a-941e99a8d526">
  <name>торо_АналогиНоменклатурыДляРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="810e87f2-60ec-4c6f-a698-b46ac061bf7a">
    <name>ПериодЗавершения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="b7da3a7a-7f93-4d82-b739-a7fce6b51bb5">
    <name>УпаковкаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="a912cf23-ea02-49c6-9436-c42a62dc455e">
    <name>КоличествоМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62b487cf-3318-420c-850b-a279c9ea8cdc">
    <name>КоличествоУпаковокМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="ce89a4f9-62f1-4509-a089-dce3ae891031">
    <name>УпаковкаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5153709f-d763-4f1c-b0b0-4662a1f640f4">
    <name>КоличествоАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="8cec5131-0504-466d-ac20-43194aba1d2c">
    <name>КоличествоУпаковокАналога</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="59851635-0a58-4b1c-8731-113c1e7c611e">
    <name>Материал</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0abaad15-010c-4720-b462-1a1169662393">
    <name>ХарактеристикаМатериала</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3e0ba762-2301-4507-bb58-f8a616708252">
    <name>ТехКарта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="3abcbaea-a6e9-479b-956d-13dc9e932eb0">
    <name>КлючСвязиСпецификация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="1ea4a6a3-d4bb-4680-a389-ddbe5b71d9c8">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="21559ab3-21fe-4274-93d2-bead9faf4226">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="554b3f39-42e7-4c9c-93d9-4d44f5dc9c0d">
    <name>ВидРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ad8d66e2-91c2-4772-a887-4764fd6f2379">
    <name>ОбъектРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="80a5eaa4-3b19-491a-84a3-998bc6f03267">
    <name>НаправлениеОбъектаРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="49bd9538-5775-49d3-a7d5-ee278e515679">
    <name>Аналог</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="df826c69-f7c0-41bd-a065-365bf48abb7e">
    <name>ХарактеристикаАналога</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/toir_cfe/src/DataProcessors/торо_РабочееМестоСпециалистаОбеспечения/Forms/проф_ФормаЗаменаАналогом/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Проф-ИТ, #228, Соловьев А.А., 13.10.2023
	Заказ 				= Параметры.Заказ;
	КодСтроки 			= Параметры.КодСтроки;
	//КоличествоКЗамене 	= Параметры.КоличествоКЗамене;
	КоличествоОсталось 	= Параметры.КоличествоКЗамене;
	Номенклатура 		= Параметры.Номенклатура;
	НоменклатураАналог 	= Параметры.НоменклатураАналог;
	Разрешение 			= Параметры.Разрешение;
	Заголовок			= НСтр("ru = 'Замена номенклатуры аналогом'");
	КоличествоАналогаДоступно = Параметры.Доступно;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА торо_АналогиНоменклатурыДляРемонтов.КоличествоМатериала = 0
	|			ТОГДА 0
	|		ИНАЧЕ торо_АналогиНоменклатурыДляРемонтов.КоличествоАналога / торо_АналогиНоменклатурыДляРемонтов.КоличествоМатериала
	|	КОНЕЦ КАК Коэффициент
	|ИЗ
	|	РегистрСведений.торо_АналогиНоменклатурыДляРемонтов КАК торо_АналогиНоменклатурыДляРемонтов
	|ГДЕ
	|	торо_АналогиНоменклатурыДляРемонтов.Регистратор = &Регистратор
	|	И торо_АналогиНоменклатурыДляРемонтов.Материал = &Материал
	|	И торо_АналогиНоменклатурыДляРемонтов.Аналог = &Аналог";
	
	Запрос.УстановитьПараметр("Аналог", НоменклатураАналог);
	Запрос.УстановитьПараметр("Материал", Номенклатура);
	Запрос.УстановитьПараметр("Регистратор", Разрешение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		КоэффициентЗамены = Выборка.Коэффициент;
		Если КоэффициентЗамены > 0 Тогда
			КоличествоАналога = КоэффициентЗамены * КоличествоОсталось;
		КонецЕсли;
	КонецЕсли;
	
	Если КоэффициентЗамены = 0 Тогда 
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Не найден аналог в документе %1'"), Разрешение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Если КоличествоАналога > КоличествоАналогаДоступно Тогда 
		КоличествоКЗамене = КоличествоАналогаДоступно / КоэффициентЗамены;
		КоличествоАналога = КоличествоАналогаДоступно;
	Иначе
		КоличествоКЗамене = КоличествоАналога / КоэффициентЗамены;
	КонецЕсли;
	//-- Проф-ИТ, #228, Соловьев А.А., 13.10.2023
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура Выбрать(Команда)
	
	//++ Проф-ИТ, #228, Соловьев А.А., 13.10.2023
	ОчиститьСообщения();
	СообщениеОбОшибке = ПроизвестиЗаменуНаСервере();
	Если ПустаяСтрока(СообщениеОбОшибке) Тогда 		
		Закрыть(КодВозвратаДиалога.Да);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке);
	КонецЕсли;
	//-- Проф-ИТ, #228, Соловьев А.А., 13.10.2023
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
	
&НаКлиенте
Процедура КоличествоКЗаменеПриИзменении(Элемент)
	
	//++ Проф-ИТ, #228, Соловьев А.А., 16.10.2023
	КоличествоАналога = КоэффициентЗамены * КоличествоКЗамене;

	Если КоличествоАналога > КоличествоАналогаДоступно Тогда 
		КоличествоКЗамене = КоличествоАналогаДоступно / КоэффициентЗамены;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Количество аналога не может быть больше доступного количества: %1'"),
							КоличествоАналогаДоступно);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;	
		
	Если КоличествоКЗамене > КоличествоОсталось Тогда 
		КоличествоКЗамене = КоличествоОсталось;
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Количество к замене не может быть больше, чем необходимо обеспечить: %1'"),
							КоличествоОсталось);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	//-- Проф-ИТ, #228, Соловьев А.А., 16.10.2023
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере
Функция ПроизвестиЗаменуНаСервере()
	
	//++ Проф-ИТ, #228, Соловьев А.А., 13.10.2023
	
	СтрНоменклатура = "Номенклатура";
	
	НачатьТранзакцию();
	
	Попытка
		ЗаказОбъект = Заказ.ПолучитьОбъект();
		СтрокаСНоменклатурой = ЗаказОбъект.Товары.Найти(КодСтроки, "КодСтроки");
		Если СтрокаСНоменклатурой = Неопределено Тогда 
			Возврат НСтр("ru = 'В документе не найдена строка для замены'");
		КонецЕсли;
		СтрокаСАналогом = ЗаказОбъект.Товары.Найти(НоменклатураАналог, СтрНоменклатура);
		
		СтруктураТекущейСтроки = Новый Структура("Номенклатура, Характеристика, КодСтроки, ЕстьАналоги");
		ЗаполнитьЗначенияСвойств(СтруктураТекущейСтроки, СтрокаСНоменклатурой);
		
		ТипЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3));
		ТипБулево = Новый ОписаниеТипов("Булево");
		ТипНоменклатура = Новый ОписаниеТипов("СправочникСсылка.Номенклатура");
		
		ТаблицаДанных = Новый ТаблицаЗначений;
		ТаблицаДанных.Колонки.Добавить(СтрНоменклатура, ТипНоменклатура);
		ТаблицаДанных.Колонки.Добавить("Количество", ТипЧисло);
		ТаблицаДанных.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиНоменклатуры"));
		ТаблицаДанных.Колонки.Добавить("ХарактеристикаНоменклатуры",
			Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
		ТаблицаДанных.Колонки.Добавить("КодСтрокиНоменклатуры", ТипЧисло);
		ТаблицаДанных.Колонки.Добавить("КодСтрокиАналога", ТипЧисло);
		ТаблицаДанных.Колонки.Добавить("ХарактеристикиИспользуются", ТипБулево);
		ТаблицаДанных.Колонки.Добавить("Исходная", ТипБулево);
		ТаблицаДанных.Колонки.Добавить("Изменен", ТипБулево);
		ТаблицаДанных.Колонки.Добавить("ЗамененноеКоличество", ТипЧисло);
		ТаблицаДанных.Колонки.Добавить("Удален", ТипБулево);
		ТаблицаДанных.Колонки.Добавить("НоменклатураИсходная", ТипНоменклатура);
		
		НоваяСтрокаИсходная = ТаблицаДанных.Добавить();
		НоваяСтрокаАналог = ТаблицаДанных.Добавить();
		
		НоваяСтрокаИсходная.Номенклатура = Номенклатура;
		НоваяСтрокаИсходная.Количество = СтрокаСНоменклатурой.Количество - КоличествоКЗамене;
		НоваяСтрокаИсходная.ЕдиницаИзмерения = СтрокаСНоменклатурой.Упаковка;
		НоваяСтрокаИсходная.ХарактеристикиИспользуются = Ложь;
		НоваяСтрокаИсходная.КодСтрокиНоменклатуры = СтрокаСНоменклатурой.КодСтроки;
		НоваяСтрокаИсходная.КодСтрокиАналога = ?(СтрокаСАналогом = Неопределено, 0, СтрокаСАналогом.КодСтроки);
		НоваяСтрокаИсходная.Исходная = Истина;
		НоваяСтрокаИсходная.Изменен = Истина;
		НоваяСтрокаИсходная.Удален = Ложь;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаАналог, НоваяСтрокаИсходная);
		НоваяСтрокаАналог.Номенклатура = НоменклатураАналог;
		НоваяСтрокаАналог.Количество = КоличествоАналога + ?(СтрокаСАналогом = Неопределено, 0, СтрокаСАналогом.Количество);
		НоваяСтрокаАналог.Исходная = Ложь;
		НоваяСтрокаАналог.ЗамененноеКоличество = КоличествоКЗамене;
		НоваяСтрокаАналог.НоменклатураИсходная = СтрокаСНоменклатурой.Номенклатура;
		
		Документы.ЗаказНаВнутреннееПотребление.ОбработатьЗаменуНоменклатурыНаАналоги(Ложь,
			ЗаказОбъект, ТаблицаДанных, СтруктураТекущейСтроки, Номенклатура);
			
		ЗаказОбъект.БезусловнаяЗапись = Истина;
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Заказ", 				ЗаказОбъект.Ссылка);
		СтруктураПараметров.Вставить("Дата", 				ЗаказОбъект.Дата);
		СтруктураПараметров.Вставить("Номенклатура", 		Номенклатура);
		СтруктураПараметров.Вставить("Разрешение", 			Разрешение);
		СтруктураПараметров.Вставить("НоменклатураАналог", 	НоменклатураАналог);
		СтруктураПараметров.Вставить("КоличествоКЗамене", 	КоличествоКЗамене);
		СтруктураПараметров.Вставить("КоличествоАналога", 	КоличествоАналога);
		
		Документы.ЗаказНаВнутреннееПотребление.ЗаписьВРегистрЗаменаНаАналоги(СтруктураПараметров);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		Возврат СтрШаблон(НСтр("ru = 'Не удалось заменить номенклатуру по причине: %1'"), ОписаниеОшибки());
	КонецПопытки;
	
	Возврат "";
	//-- Проф-ИТ, #228, Соловьев А.А., 13.10.2023
	
КонецФункции

#КонецОбласти
